load-tests/results/scale-1-20260812-221345.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/seckill.js
        output: -

     scenarios: (100.00%) 1 scenario, 20000 max VUs, 2m10s max duration (incl. graceful stop):
              * staged_seckill: Up to 20000.00 iterations/s for 1m40s over 4 stages (maxVUs: 500-20000, gracefulStop: 30s)


running (0m01.0s), 00000/00500 VUs, 130 complete and 0 interrupted iterations
staged_seckill   [   1% ] 00000/00500 VUs  0m01.0s/1m40s  00172.73 iters/s

running (0m02.0s), 00000/00500 VUs, 340 complete and 0 interrupted iterations
staged_seckill   [   2% ] 00001/00500 VUs  0m02.0s/1m40s  00248.81 iters/s

running (0m03.0s), 00002/00500 VUs, 626 complete and 0 interrupted iterations
staged_seckill   [   3% ] 00002/00500 VUs  0m03.0s/1m40s  00324.86 iters/s

running (0m04.0s), 00001/00500 VUs, 989 complete and 0 interrupted iterations
staged_seckill   [   4% ] 00001/00500 VUs  0m04.0s/1m40s  00400.69 iters/s

running (0m05.0s), 00001/00500 VUs, 1428 complete and 0 interrupted iterations
staged_seckill   [   5% ] 00001/00500 VUs  0m05.0s/1m40s  00476.74 iters/s

running (0m06.0s), 00001/00500 VUs, 1943 complete and 0 interrupted iterations
staged_seckill   [   6% ] 00001/00500 VUs  0m06.0s/1m40s  00552.78 iters/s

running (0m07.0s), 00000/00500 VUs, 2534 complete and 0 interrupted iterations
staged_seckill   [   7% ] 00000/00500 VUs  0m07.0s/1m40s  00628.68 iters/s

running (0m08.0s), 00002/00500 VUs, 3200 complete and 0 interrupted iterations
staged_seckill   [   8% ] 00002/00500 VUs  0m08.0s/1m40s  00704.83 iters/s

running (0m09.0s), 00001/00500 VUs, 3943 complete and 0 interrupted iterations
staged_seckill   [   9% ] 00001/00500 VUs  0m09.0s/1m40s  00780.75 iters/s

running (0m10.0s), 00001/00500 VUs, 4762 complete and 0 interrupted iterations
staged_seckill   [  10% ] 00001/00500 VUs  0m10.0s/1m40s  00856.77 iters/s

running (0m11.0s), 00001/00500 VUs, 5656 complete and 0 interrupted iterations
staged_seckill   [  11% ] 00001/00500 VUs  0m11.0s/1m40s  00932.71 iters/s

running (0m12.0s), 00001/00500 VUs, 6627 complete and 0 interrupted iterations
staged_seckill   [  12% ] 00001/00500 VUs  0m12.0s/1m40s  01008.73 iters/s

running (0m13.0s), 00001/00500 VUs, 7674 complete and 0 interrupted iterations
staged_seckill   [  13% ] 00001/00500 VUs  0m13.0s/1m40s  01084.75 iters/s

running (0m14.0s), 00002/00500 VUs, 8796 complete and 0 interrupted iterations
staged_seckill   [  14% ] 00002/00500 VUs  0m14.0s/1m40s  01160.76 iters/s

running (0m15.0s), 00000/00500 VUs, 9995 complete and 0 interrupted iterations
staged_seckill   [  15% ] 00001/00500 VUs  0m15.0s/1m40s  01236.72 iters/s

running (0m16.0s), 00001/00500 VUs, 11270 complete and 0 interrupted iterations
staged_seckill   [  16% ] 00001/00500 VUs  0m16.0s/1m40s  01312.73 iters/s

running (0m17.0s), 00004/00500 VUs, 12618 complete and 0 interrupted iterations
staged_seckill   [  17% ] 00004/00500 VUs  0m17.0s/1m40s  01388.75 iters/s

running (0m18.0s), 00007/00500 VUs, 14042 complete and 0 interrupted iterations
staged_seckill   [  18% ] 00007/00500 VUs  0m18.0s/1m40s  01464.76 iters/s

running (0m19.0s), 00000/00500 VUs, 15550 complete and 0 interrupted iterations
staged_seckill   [  19% ] 00000/00500 VUs  0m19.0s/1m40s  01540.67 iters/s

running (0m20.0s), 00001/00500 VUs, 17128 complete and 0 interrupted iterations
staged_seckill   [  20% ] 00001/00500 VUs  0m20.0s/1m40s  01616.69 iters/s

running (0m21.0s), 00000/00500 VUs, 18783 complete and 0 interrupted iterations
staged_seckill   [  21% ] 00002/00500 VUs  0m21.0s/1m40s  01692.75 iters/s

running (0m22.0s), 00001/00500 VUs, 20514 complete and 0 interrupted iterations
staged_seckill   [  22% ] 00001/00500 VUs  0m22.0s/1m40s  01768.72 iters/s

running (0m23.0s), 00002/00500 VUs, 22320 complete and 0 interrupted iterations
staged_seckill   [  23% ] 00002/00500 VUs  0m23.0s/1m40s  01844.73 iters/s

running (0m24.0s), 00001/00500 VUs, 24203 complete and 0 interrupted iterations
staged_seckill   [  24% ] 00002/00500 VUs  0m24.0s/1m40s  01920.74 iters/s

running (0m25.0s), 00001/00500 VUs, 26162 complete and 0 interrupted iterations
staged_seckill   [  25% ] 00001/00500 VUs  0m25.0s/1m40s  01996.71 iters/s

running (0m26.0s), 00001/00500 VUs, 28235 complete and 0 interrupted iterations
staged_seckill   [  26% ] 00002/00500 VUs  0m26.0s/1m40s  02153.14 iters/s

running (0m27.0s), 00000/00500 VUs, 30467 complete and 0 interrupted iterations
staged_seckill   [  27% ] 00001/00500 VUs  0m27.0s/1m40s  02313.13 iters/s

running (0m28.0s), 00002/00500 VUs, 32861 complete and 0 interrupted iterations
staged_seckill   [  28% ] 00002/00500 VUs  0m28.0s/1m40s  02473.12 iters/s

running (0m29.0s), 00004/00500 VUs, 35412 complete and 0 interrupted iterations
staged_seckill   [  29% ] 00003/00500 VUs  0m29.0s/1m40s  02633.11 iters/s

running (0m30.0s), 00002/00500 VUs, 38127 complete and 0 interrupted iterations
staged_seckill   [  30% ] 00002/00500 VUs  0m30.0s/1m40s  02793.10 iters/s

running (0m31.0s), 00000/00500 VUs, 41002 complete and 0 interrupted iterations
staged_seckill   [  31% ] 00001/00500 VUs  0m31.0s/1m40s  02953.27 iters/s

running (0m32.0s), 00000/00500 VUs, 44033 complete and 0 interrupted iterations
staged_seckill   [  32% ] 00001/00500 VUs  0m32.0s/1m40s  03113.09 iters/s

running (0m33.0s), 00002/00500 VUs, 47226 complete and 0 interrupted iterations
staged_seckill   [  33% ] 00002/00500 VUs  0m33.0s/1m40s  03273.14 iters/s

running (0m34.0s), 00003/00500 VUs, 50579 complete and 0 interrupted iterations
staged_seckill   [  34% ] 00003/00500 VUs  0m34.0s/1m40s  03433.13 iters/s

running (0m35.0s), 00064/00500 VUs, 54025 complete and 0 interrupted iterations
staged_seckill   [  35% ] 00064/00500 VUs  0m35.0s/1m40s  03592.81 iters/s

running (0m36.0s), 00199/00552 VUs, 56988 complete and 0 interrupted iterations
staged_seckill   [  36% ] 00199/00552 VUs  0m36.0s/1m40s  03753.12 iters/s

running (0m37.0s), 00027/00606 VUs, 59686 complete and 0 interrupted iterations
staged_seckill   [  37% ] 00027/00606 VUs  0m37.0s/1m40s  03913.11 iters/s

running (0m38.0s), 00001/00606 VUs, 63703 complete and 0 interrupted iterations
staged_seckill   [  38% ] 00002/00606 VUs  0m38.0s/1m40s  04073.10 iters/s

running (0m39.0s), 00005/00606 VUs, 67854 complete and 0 interrupted iterations
staged_seckill   [  39% ] 00005/00606 VUs  0m39.0s/1m40s  04233.11 iters/s

running (0m40.0s), 00002/00606 VUs, 72168 complete and 0 interrupted iterations
staged_seckill   [  40% ] 00002/00606 VUs  0m40.0s/1m40s  04393.02 iters/s

running (0m41.0s), 00004/00606 VUs, 76641 complete and 0 interrupted iterations
staged_seckill   [  41% ] 00004/00606 VUs  0m41.0s/1m40s  04553.11 iters/s

running (0m42.1s), 00558/00606 VUs, 79332 complete and 0 interrupted iterations
staged_seckill   [  42% ] 00577/00606 VUs  0m42.1s/1m40s  04667.47 iters/s

running (0m43.0s), 00369/00641 VUs, 82346 complete and 0 interrupted iterations
staged_seckill   [  43% ] 00369/00641 VUs  0m43.0s/1m40s  04873.10 iters/s

running (0m44.0s), 00037/00641 VUs, 87630 complete and 0 interrupted iterations
staged_seckill   [  44% ] 00037/00641 VUs  0m44.0s/1m40s  05033.07 iters/s

running (0m45.0s), 00000/00641 VUs, 92777 complete and 0 interrupted iterations
staged_seckill   [  45% ] 00000/00641 VUs  0m45.0s/1m40s  05192.97 iters/s

running (0m46.0s), 00005/00641 VUs, 98050 complete and 0 interrupted iterations
staged_seckill   [  46% ] 00005/00641 VUs  0m46.0s/1m40s  05353.12 iters/s

running (0m47.0s), 00002/00641 VUs, 103483 complete and 0 interrupted iterations
staged_seckill   [  47% ] 00003/00641 VUs  0m47.0s/1m40s  05513.10 iters/s

running (0m48.0s), 00007/00641 VUs, 109077 complete and 0 interrupted iterations
staged_seckill   [  48% ] 00007/00641 VUs  0m48.0s/1m40s  05673.18 iters/s

running (0m49.0s), 00005/00641 VUs, 114829 complete and 0 interrupted iterations
staged_seckill   [  49% ] 00005/00641 VUs  0m49.0s/1m40s  05833.11 iters/s

running (0m50.0s), 00006/00641 VUs, 120740 complete and 0 interrupted iterations
staged_seckill   [  50% ] 00006/00641 VUs  0m50.0s/1m40s  05993.08 iters/s

running (0m51.0s), 00006/00641 VUs, 126814 complete and 0 interrupted iterations
staged_seckill   [  51% ] 00007/00641 VUs  0m51.0s/1m40s  06153.13 iters/s

running (0m52.0s), 00005/00641 VUs, 133048 complete and 0 interrupted iterations
staged_seckill   [  52% ] 00005/00641 VUs  0m52.0s/1m40s  06313.09 iters/s

running (0m53.0s), 00001/00641 VUs, 139441 complete and 0 interrupted iterations
staged_seckill   [  53% ] 00001/00641 VUs  0m53.0s/1m40s  06473.12 iters/s

running (0m54.0s), 00010/00641 VUs, 145988 complete and 0 interrupted iterations
staged_seckill   [  54% ] 00012/00641 VUs  0m54.0s/1m40s  06633.10 iters/s

running (0m55.0s), 00000/00641 VUs, 152709 complete and 0 interrupted iterations
staged_seckill   [  55% ] 00000/00641 VUs  0m55.0s/1m40s  06793.02 iters/s

running (0m56.0s), 00000/00641 VUs, 159579 complete and 0 interrupted iterations
staged_seckill   [  56% ] 00000/00641 VUs  0m56.0s/1m40s  06952.94 iters/s

running (0m57.0s), 00006/00641 VUs, 166613 complete and 0 interrupted iterations
staged_seckill   [  57% ] 00006/00641 VUs  0m57.0s/1m40s  07113.08 iters/s

running (0m58.0s), 00008/00641 VUs, 173805 complete and 0 interrupted iterations
staged_seckill   [  58% ] 00008/00641 VUs  0m58.0s/1m40s  07273.10 iters/s

running (0m59.0s), 00009/00641 VUs, 181154 complete and 0 interrupted iterations
staged_seckill   [  59% ] 00009/00641 VUs  0m59.0s/1m40s  07433.07 iters/s

running (1m00.0s), 00151/00641 VUs, 188519 complete and 0 interrupted iterations
staged_seckill   [  60% ] 00151/00641 VUs  1m00.0s/1m40s  07592.96 iters/s

running (1m01.0s), 00013/00641 VUs, 196336 complete and 0 interrupted iterations
staged_seckill   [  61% ] 00015/00641 VUs  1m01.0s/1m40s  07753.14 iters/s

running (1m02.0s), 00005/00641 VUs, 204180 complete and 0 interrupted iterations
staged_seckill   [  62% ] 00005/00641 VUs  1m02.0s/1m40s  07913.15 iters/s

running (1m03.0s), 00008/00641 VUs, 212170 complete and 0 interrupted iterations
staged_seckill   [  63% ] 00007/00641 VUs  1m03.0s/1m40s  08073.11 iters/s

running (1m04.0s), 00010/00641 VUs, 220320 complete and 0 interrupted iterations
staged_seckill   [  64% ] 00010/00641 VUs  1m04.0s/1m40s  08233.10 iters/s

running (1m05.0s), 00012/00641 VUs, 228632 complete and 0 interrupted iterations
staged_seckill   [  65% ] 00012/00641 VUs  1m05.0s/1m40s  08393.06 iters/s

running (1m06.0s), 00009/00641 VUs, 237109 complete and 0 interrupted iterations
staged_seckill   [  66% ] 00010/00641 VUs  1m06.0s/1m40s  08553.15 iters/s

running (1m07.0s), 00009/00641 VUs, 245741 complete and 0 interrupted iterations
staged_seckill   [  67% ] 00009/00641 VUs  1m07.0s/1m40s  08713.08 iters/s

running (1m08.0s), 00006/00641 VUs, 254536 complete and 0 interrupted iterations
staged_seckill   [  68% ] 00007/00641 VUs  1m08.0s/1m40s  08873.11 iters/s

running (1m09.0s), 00630/00767 VUs, 259297 complete and 0 interrupted iterations
staged_seckill   [  69% ] 00630/00767 VUs  1m09.0s/1m40s  09035.46 iters/s

running (1m10.0s), 00877/01027 VUs, 261343 complete and 0 interrupted iterations
staged_seckill   [  70% ] 00887/01027 VUs  1m10.0s/1m40s  09187.12 iters/s

running (1m11.0s), 00060/01119 VUs, 270936 complete and 0 interrupted iterations
staged_seckill   [  71% ] 00060/01119 VUs  1m11.0s/1m40s  09353.22 iters/s

running (1m12.0s), 00010/01119 VUs, 280411 complete and 0 interrupted iterations
staged_seckill   [  72% ] 00010/01119 VUs  1m12.0s/1m40s  09513.12 iters/s

running (1m13.0s), 00011/01119 VUs, 289998 complete and 0 interrupted iterations
staged_seckill   [  73% ] 00011/01119 VUs  1m13.0s/1m40s  09673.05 iters/s

running (1m14.0s), 00187/01119 VUs, 299531 complete and 0 interrupted iterations
staged_seckill   [  74% ] 00187/01119 VUs  1m14.0s/1m40s  09832.36 iters/s

running (1m15.0s), 00010/01119 VUs, 309671 complete and 0 interrupted iterations
staged_seckill   [  75% ] 00010/01119 VUs  1m15.0s/1m40s  09993.10 iters/s

running (1m16.0s), 00011/01119 VUs, 319854 complete and 0 interrupted iterations
staged_seckill   [  76% ] 00011/01119 VUs  1m16.0s/1m40s  10382.81 iters/s

running (1m17.0s), 00024/01119 VUs, 330422 complete and 0 interrupted iterations
staged_seckill   [  77% ] 00024/01119 VUs  1m17.0s/1m40s  10782.83 iters/s

running (1m18.0s), 00023/01119 VUs, 341407 complete and 0 interrupted iterations
staged_seckill   [  78% ] 00024/01119 VUs  1m18.0s/1m40s  11182.81 iters/s

running (1m19.0s), 00018/01119 VUs, 352787 complete and 0 interrupted iterations
staged_seckill   [  79% ] 00018/01119 VUs  1m19.0s/1m40s  11582.52 iters/s

running (1m20.0s), 01026/01119 VUs, 363545 complete and 0 interrupted iterations
staged_seckill   [  80% ] 01026/01119 VUs  1m20.0s/1m40s  11982.65 iters/s

running (1m21.0s), 00692/01300 VUs, 373870 complete and 0 interrupted iterations
staged_seckill   [  81% ] 00692/01300 VUs  1m21.0s/1m40s  12381.45 iters/s

running (1m22.0s), 01494/01554 VUs, 382737 complete and 0 interrupted iterations
staged_seckill   [  82% ] 01495/01554 VUs  1m22.0s/1m40s  12782.98 iters/s

running (1m23.0s), 00030/01630 VUs, 396585 complete and 0 interrupted iterations
staged_seckill   [  83% ] 00031/01630 VUs  1m23.0s/1m40s  13182.87 iters/s

running (1m24.0s), 00310/01630 VUs, 409695 complete and 0 interrupted iterations
staged_seckill   [  84% ] 00310/01630 VUs  1m24.0s/1m40s  13582.90 iters/s

running (1m25.0s), 01084/01630 VUs, 422716 complete and 0 interrupted iterations
staged_seckill   [  85% ] 01084/01630 VUs  1m25.0s/1m40s  13983.47 iters/s

running (1m26.0s), 01910/01910 VUs, 426324 complete and 0 interrupted iterations
staged_seckill   [  86% ] 01910/01910 VUs  1m26.0s/1m40s  14383.32 iters/s

running (1m27.0s), 02090/02202 VUs, 430266 complete and 0 interrupted iterations
staged_seckill   [  87% ] 02089/02202 VUs  1m27.0s/1m40s  14780.44 iters/s

running (1m28.0s), 02720/02722 VUs, 435981 complete and 0 interrupted iterations
staged_seckill   [  88% ] 02720/02722 VUs  1m28.0s/1m40s  15182.80 iters/s

running (1m29.0s), 03030/03116 VUs, 443562 complete and 0 interrupted iterations
staged_seckill   [  89% ] 03029/03116 VUs  1m29.0s/1m40s  15582.63 iters/s

running (1m30.0s), 03582/03583 VUs, 449881 complete and 0 interrupted iterations
staged_seckill   [  90% ] 03582/03583 VUs  1m30.0s/1m40s  15983.12 iters/s

running (1m31.0s), 03900/03900 VUs, 458239 complete and 0 interrupted iterations
staged_seckill   [  91% ] 03900/03900 VUs  1m31.0s/1m40s  16383.77 iters/s

running (1m32.0s), 04356/04538 VUs, 462429 complete and 0 interrupted iterations
staged_seckill   [  92% ] 04356/04538 VUs  1m32.0s/1m40s  16745.93 iters/s

running (1m33.0s), 04877/04878 VUs, 469134 complete and 0 interrupted iterations
staged_seckill   [  93% ] 04877/04878 VUs  1m33.0s/1m40s  17182.72 iters/s

running (1m34.0s), 05396/05457 VUs, 474900 complete and 0 interrupted iterations
staged_seckill   [  94% ] 05394/05457 VUs  1m34.0s/1m40s  17582.73 iters/s

running (1m35.0s), 05984/05984 VUs, 478090 complete and 0 interrupted iterations
staged_seckill   [  95% ] 05983/05985 VUs  1m35.0s/1m40s  17984.96 iters/s

running (1m36.0s), 06698/06698 VUs, 482018 complete and 0 interrupted iterations
staged_seckill   [  96% ] 06698/06698 VUs  1m36.0s/1m40s  18384.04 iters/s

running (1m37.0s), 07014/07019 VUs, 483637 complete and 0 interrupted iterations
staged_seckill   [  97% ] 07014/07019 VUs  1m37.0s/1m40s  18782.16 iters/s

running (1m38.0s), 07498/07498 VUs, 485179 complete and 0 interrupted iterations
staged_seckill   [  98% ] 07498/07498 VUs  1m38.0s/1m40s  19182.44 iters/s

running (1m39.0s), 07654/07654 VUs, 489373 complete and 0 interrupted iterations
staged_seckill   [  99% ] 07654/07655 VUs  1m39.0s/1m40s  19412.20 iters/s

running (1m40.0s), 07902/07903 VUs, 491245 complete and 0 interrupted iterations
staged_seckill   [ 100% ] 07902/07903 VUs  1m40.0s/1m40s  19982.42 iters/s

running (1m41.0s), 02367/07914 VUs, 496832 complete and 0 interrupted iterations
staged_seckill ↓ [ 100% ] 07897/07913 VUs  1m40s  19995.20 iters/s

     ✗ token issued
      ↳  98% — ✓ 489992 / ✗ 9207
     ✗ business response is expected
      ↳  90% — ✓ 445406 / ✗ 44586

     business_acceptance_rate.......: 0.20%  1000 out of 489992
     business_orders_accepted.......: 1000   9.878174/s
     business_orders_rejected.......: 488992 4830.348098/s
   ✗ business_token_failures........: 9207   90.948349/s
     checks.........................: 94.56% 935398 out of 989191
     data_received..................: 229 MB 2.3 MB/s
     data_sent......................: 164 MB 1.6 MB/s
     dropped_iterations.............: 201804 1993.455041/s
     http_req_blocked...............: avg=11.71µs  min=333ns      med=1µs      max=97.63ms  p(90)=2.29µs   p(95)=3.91µs  
     http_req_connecting............: avg=7µs      min=0s         med=0s       max=97.61ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=84.19ms  min=10.5µs     med=586.2µs  max=2.69s    p(90)=234.17ms p(95)=468.62ms
       { expected_response:true }...: avg=79.47ms  min=10.5µs     med=564.75µs max=2.69s    p(90)=221.54ms p(95)=455.34ms
   ✗ http_req_failed................: 5.43%  53793 out of 989191
     http_req_receiving.............: avg=321.79µs min=-1053514ns med=8.66µs   max=320.99ms p(90)=58.5µs   p(95)=169.39µs
     http_req_sending...............: avg=124.91µs min=-1020723ns med=2.66µs   max=145.44ms p(90)=10.45µs  p(95)=33.58µs 
     http_req_tls_handshaking.......: avg=0s       min=0s         med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=83.74ms  min=0s         med=563.04µs max=2.69s    p(90)=232.19ms p(95)=467.7ms 
     http_reqs......................: 989191 9771.400892/s
     iteration_duration.............: avg=168.41ms min=219.62µs   med=1.26ms   max=4.49s    p(90)=479.14ms p(95)=957.78ms
     iterations.....................: 499199 4931.17462/s
   ✗ seckill_latency................: avg=83.04ms  min=104.81µs   med=609µs    max=2.53s    p(90)=231.83ms p(95)=470.33ms
     vus............................: 2369   min=0                max=7902
     vus_max........................: 7914   min=500              max=7914


running (1m41.2s), 00000/07914 VUs, 499199 complete and 0 interrupted iterations
staged_seckill ✓ [ 100% ] 00000/07914 VUs  1m40s  19995.20 iters/s